---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.NetworkPressureNotConverge
source: html/d624f509-e579-9c41-0e2d-3ec30e5bc9b9.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.NetworkPressureNotConverge Property

The calculation could not be performed. Verify the pressure on the input element.

## Syntax (C#)
```csharp
public static FailureDefinitionId NetworkPressureNotConverge { get; }
```